# Werkcollege-opdrachten Week 1.3

## Dependencies importeren

Kopieer in het codeblok hieronder van het vorige practicum de import-code voor de dependencies die het vaakst worden gebruikt om data in te lezen. Geef er ook de gebruikelijke aliassen aan.<br>
Zet eventuele warnings uit.

In [3]:

import warnings
warnings.simplefilter('ignore')

import pandas as pd
import sqlite3

Zet het bestand go_sales_train.sqlite in een makkelijk te vinden map

## Databasetabellen inlezen

Kopieer in het codeblok hieronder van het vorige practicum de code om een connectie met het bestand go_sales_train.sqlite te maken.

In [4]:
db_path = 'Sqlite files/go_sales_train.sqlite'

sales_conn = sqlite3.connect(db_path)
sales_conn

Lees van de ingelezen go_sales_train-database te volgende tabellen in met behulp van "SELECT * FROM *tabel*".
- product
- product_type
- product_line
- sales_staff
- sales_branch
- retailer_site
- country
- order_header
- order_details
- returned_item
- return_reason

In [12]:
sql_queryp = "SELECT * FROM product;"
sql_queryc = "SELECT * FROM country;"
sql_queryr = "SELECT * FROM retailer_site;"
sql_queryri = "SELECT * FROM returned_item;"
sql_queryyy = "SELECT * FROM order_header;"
sf_product = pd.read_sql_query(sql_queryp, sales_conn)
sf_country = pd.read_sql_query(sql_queryc, sales_conn)
sf_retailer = pd.read_sql_query(sql_queryr, sales_conn)
sf_returned = pd.read_sql_query(sql_queryri, sales_conn)
sf_order_header = pd.read_sql_query(sql_queryyy, sales_conn)

Krijg je een "no such table" error? Dan heb je misschien met .connect() per ongeluk een leeg  databasebestand (.sqlite) aangemaakt. <u>Let op:</u> lees eventueel de informatie uit het Notebook van werkcollege 1.1b nog eens goed door.

Als je tijdens onderstaande opdrachten uit het oog verliest welke tabellen er allemaal zijn, kan je deze Pythoncode uitvoeren:

In [10]:
sql_query = "PRAGMA table_info(product);"
#Vul dit codeblok verder in
pd.read_sql(sql_query, sales_conn)

   cid               name     type  notnull dflt_value  pk
0    0     PRODUCT_NUMBER  INTEGER        0       None   0
1    1  INTRODUCTION_DATE     TEXT        0       None   0
2    2  PRODUCT_TYPE_CODE  INTEGER        0       None   0
3    3    PRODUCTION_COST     REAL        0       None   0
4    4             MARGIN     REAL        0       None   0
5    5      PRODUCT_IMAGE     TEXT        0       None   0
6    6           LANGUAGE     TEXT        0       None   0
7    7       PRODUCT_NAME     TEXT        0       None   0
8    8        DESCRIPTION     TEXT        0       None   0

erachter

Let op! Voor alle onderstaande opdrachten mag je <u>alleen Python</u> gebruiken, <u>geen SQL!</u>

## Selecties op één tabel zonder functies

Geef een overzicht met daarin de producten en hun productiekosten waarvan de productiekosten lager dan 100 dollar en hoger dan 50 dollar ligt. (2 kolommen, 23 rijen)

In [19]:
filtered = sf_product.loc[(sf_product['PRODUCTION_COST'] > 50) & (sf_product['PRODUCTION_COST'] < 100)]
filtered

,PRODUCT_NUMBER,INTRODUCTION_DATE,PRODUCT_TYPE_CODE,PRODUCTION_COST,MARGIN,PRODUCT_IMAGE,LANGUAGE,PRODUCT_NAME,DESCRIPTION
5,6,1997-03-05,1,85.11,0.28,P06CE1CG1.jpg,EN,TrailChef Deluxe Cook Set,"Cascade set features 1, 2, and 3 liter pots wi..."
7,8,1997-03-05,1,75.00,0.41,P08CE1CG1.jpg,EN,TrailChef Double Flame,The TrailChef Double Flame is a camp stove whi...
16,17,1997-03-05,3,60.00,0.28,P17CE1SB3.jpg,EN,Hibernator Lite,The Hibernator Lite is the perfect summer slee...
17,18,1995-02-15,3,86.00,0.33,P17CE1SB3.jpg,EN,Hibernator,The Hibernator is a three-season sleeping bag....
19,20,1997-03-05,3,78.55,0.28,P20CE1SB3.jpg,EN,Hibernator Self - Inflating Mat,Mattress is made of extra-thick foam. Mesh stu...
22,23,1997-03-05,3,65.33,0.33,P23CE1SB3.jpg,EN,Hibernator Camp Cot,Aluminum frame camp cot that is lightweight an...
23,24,1997-03-05,4,62.50,0.17,P24CE1PK4.jpg,EN,Canyon Mule Climber Backpack,This pack is perfect for day trips and short h...
45,46,2005-01-10,7,52.86,0.28,P46ME2SY7.jpg,EN,Granite Climbing Helmet,This UIAA approved helmet fits adults and kids...
47,48,2005-01-10,7,55.00,0.50,P47ME2SY7.jpg,EN,Husky Harness Extreme,One size fits all. Top of the range fully adju...
57,58,2005-01-10,9,57.13,0.28,P58ME2TL9.jpg,EN,Granite Hammer,A solid hammer made with a solid hard wood han...
68,69,1995-02-15,11,73.33,0.33,P69PA3EW11.jpg,EN,Polar Ice,Polar Ice sunglasses have polarized lenses to ...
69,70,1997-03-05,11,80.00,0.33,P70PA3EW11.jpg,EN,Polar Sports,Six base classic nylon composite frame sunglas...
70,71,1997-03-05,11,60.00,0.33,P71PA3EW11.jpg,EN,Polar Wave,Acrylex lenses in the Polar Wave sunglasses ab...
71,72,2000-10-26,11,72.50,0.50,P72PA3EW11.jpg,EN,Polar Extreme,Ideal for skiing and winter mountaineering. Fr...
74,75,2000-10-26,12,80.00,0.28,P75PA3KV12.jpg,EN,Edge Extreme,Multi-purpose pocketknife ruggedly constructed...
77,78,1995-02-15,13,79.19,0.20,P78PA3BN13.jpg,EN,Seeker 35,This 7 x 35 model is economical and performs w...
78,79,1995-02-15,13,92.58,0.25,P78PA3BN13.jpg,EN,Seeker 50,Rubber coated and ergonomically designed. The ...
79,80,1997-03-05,13,94.12,0.40,P80PA3BN13.jpg,EN,Seeker Extreme,These ergonomic binoculars are light-weight an...
82,83,1997-03-05,14,56.25,0.37,P83PA3NV14.jpg,EN,Glacier Deluxe,Magnetic Compass has a large sighting mirror w...
83,84,1997-03-05,14,78.55,0.28,P84PA3NV14.jpg,EN,Glacier GPS,"Global Positioning System that is small, light..."
109,110,2003-12-10,20,60.00,0.50,P110GE5PT20.jpg,EN,Blue Steel Putter,This premium putter has copper mixed with ligh...
110,111,2003-12-15,20,81.80,0.55,P111GE5PT20.jpg,EN,Blue Steel Max Putter,Putter head is composed from a single piece of...
113,114,2003-12-15,21,80.00,0.60,P114GE5GA21.jpg,EN,Course Pro Golf Bag,High quality golf bag that includes carrying s...

Geef een overzicht met daarin de producten en hun marge waarvan de marge lager dan 20 % of hoger dan 60 % ligt. (2 kolommen, 7 rijen)

In [ ]:
filtered = sf.loc[(sf['MARGIN'] > 0.60) | (sf['MARGIN'] < 0.20)]
filtered

,PRODUCT_NUMBER,INTRODUCTION_DATE,PRODUCT_TYPE_CODE,PRODUCTION_COST,MARGIN,PRODUCT_IMAGE,LANGUAGE,PRODUCT_NAME,DESCRIPTION
20,21,1995-02-15,3,29.17,0.17,P21CE1SB3.jpg,EN,Hibernator Pad,Warms up quickly for snow camping comfort. The...
23,24,1997-03-05,4,62.50,0.17,P24CE1PK4.jpg,EN,Canyon Mule Climber Backpack,This pack is perfect for day trips and short h...
85,86,1995-02-15,15,2.00,0.67,P86OP4IR15.jpg,EN,BugShield Natural,"Contains no chemicals. Repels mosquitoes, blac..."
86,87,1995-02-15,15,2.00,0.67,P86OP4IR15.jpg,EN,BugShield Spray,"Repels black flies, ticks, mosquitoes, chigger..."
87,88,1995-02-15,15,2.00,0.70,P86OP4IR15.jpg,EN,BugShield Lotion Lite,"Repels black flies, ticks, mosquitoes, chigger..."
88,89,1995-02-15,15,2.50,0.63,P86OP4IR15.jpg,EN,BugShield Lotion,"Repels black flies, ticks, mosquitoes, chigger..."
89,90,1995-02-15,15,2.50,0.63,P86OP4IR15.jpg,EN,BugShield Extreme,"Highest amount of the active ingredient, 38%, ..."

Geef een overzicht met daarin de landen waar met francs wordt betaald. Sorteer de uitkomst op land.  (1 kolom, 3 rijen)

In [ ]:
filtered= sf.loc[(sf["CURRENCY_NAME"] == "francs")]
filtered

    COUNTRY_CODE      COUNTRY LANGUAGE CURRENCY_NAME
0              1       France       EN        francs
7              8  Switzerland       EN        francs
15            17      Belgium       EN        francs

Geef een overzicht met daarin de verschillende introductiedatums waarop producten met meer dan 50% marge worden geïntroduceerd (1 kolom, 7 rijen)

In [ ]:
filtered = sf.loc[sf['MARGIN'] > 0.50, ['INTRODUCTION_DATE']]
filtered.drop_duplicates()

    INTRODUCTION_DATE
66         2000-10-26
85         1995-02-15
101        2003-12-10
103        2003-12-18
104        2003-12-27
106        2004-01-13
110        2003-12-15

Geef een overzicht met daarin het eerste adres en de stad van verkoopafdelingen waarvan zowel het tweede adres als de regio bekend is (2 kolommen, 7 rijen)

In [8]:
filtered = sf_retailer.loc[sf_retailer['ADDRESS2'].notna() & sf_retailer['REGION'].notna(), ['ADDRESS1', 'CITY']]
filtered.head(7)

                 ADDRESS1         CITY
13     500, Place d'Armes     Montréal
31       Röntgenstraße 90    Frankfurt
59        Grubesallee 141      Hamburg
63      2479 Broad Street     Hartford
74     10423 Kenwood Road   Cincinnati
76  332 South Main Street      Hanover
77    795 South Jefferson  Springfield

Geef een overzicht met daarin de landen waar met dollars (dollars of new dollar) wordt betaald. Sorteer de uitkomst op land. (1 kolom, 4 rijen)

In [14]:
filtered= sf_country.loc[sf_country['CURRENCY_NAME'].str.contains('dollar'), ['COUNTRY']]
filtered

          COUNTRY
2   United States
3          Canada
11         Taiwan
14      Australia

Geef een overzicht met daarin beide adressen en de stad van vestigingen van klanten waarvan de postcode begint met een ‘D’ (van duitsland). Filter op vestigingen die een tweede adres hebben. (3 kolommen, 2 rijen)

In [9]:
filtered = sf_retailer.loc[sf_retailer['POSTAL_ZONE'].str.startswith('D') & sf_retailer['ADDRESS2'].notna(), ['ADDRESS1', 'ADDRESS2', 'CITY']]
filtered

            ADDRESS1       ADDRESS2       CITY
31  Röntgenstraße 90  3. Tür rechts  Frankfurt
59   Grubesallee 141       4. Stock    Hamburg

## Selecties op één tabel met functies

Geef het totaal aantal producten dat is teruggebracht (1 waarde)

In [15]:
filtered = sf_returned['RETURN_CODE'].count()
filtered

np.int64(619)

Geef het aantal regio’s waarin verkoopafdelingen gevestigd zijn. (1 waarde)

In [17]:
sql_querysb = "SELECT * FROM sales_branch;"
sf_salesbranch = pd.read_sql_query(sql_querysb, sales_conn)

filtered = sf_salesbranch['REGION'].count()
filtered

np.int64(15)

Maak 3 variabelen:
- Een met de laagste
- Een met de hoogste
- Een met de gemiddelde (afgerond op 2 decimalen)

marge van producten (3 kolommen, 1 rij)

In [10]:
max_marge = sf_product['MARGIN'].max()
min_marge = sf_product['MARGIN'].min()
avg_marge = sf_product['MARGIN'].mean()

max_marge, min_marge, avg_marge

(np.float64(0.7), np.float64(0.17), np.float64(0.3966086956521739))

Geef het aantal vestigingen van klanten waarvan het 2e adres niet bekend is (1 waarde)

In [24]:
filtered = sf_retailer['ADDRESS1'].notna() & sf_retailer['ADDRESS2'].isna()
filtered.sum()

np.int64(286)

Geef de gemiddelde kostprijs van de verkochte producten waarop korting (unit_sale_price < unit_price) is verleend (1 waarde)

In [16]:
sql_queryod = "SELECT * FROM order_details;"
sf_orderdet = pd.read_sql_query(sql_queryod, sales_conn)

filtered = sf_orderdet[sf_orderdet['UNIT_SALE_PRICE'] < sf_orderdet['UNIT_PRICE']]['UNIT_COST'].mean()
filtered

np.float64(127.34087927598804)

Geef een overzicht met daarin het aantal medewerkers per medewerkersfunctie (2 kolommen, 7 rijen)

In [9]:
sql_queryss = "SELECT * FROM sales_staff"
sf_salesstaff = pd.read_sql_query(sql_queryss, sales_conn)

#size == count, resetindexname == 2de kolomnaam, sortvalues == orderby
filtered = (sf_salesstaff.groupby('POSITION_EN').size().reset_index(name='Aantal').sort_values('POSITION_EN', ascending=False))
filtered

                    POSITION_EN  Aantal
6              Regional Manager       2
5  Level 3 Sales Representative      24
4  Level 2 Sales Representative      39
3  Level 1 Sales Representative      13
2               General Manager       1
1              District Manager       4
0                Branch Manager      19

Geef een overzicht met daarin per telefoonnummer het aantal medewerkers dat op dat telefoonnummer bereikbaar is. Toon alleen de telefoonnummer waarop meer dan 4 medewerkers bereikbaar zijn. (2 kolommen, 10 rijen)

In [8]:
filtered = sf_salesstaff.groupby('WORK_PHONE').size().reset_index(name='Aantal medewerkers')
filtered = filtered[filtered['Aantal medewerkers'] > 4]
filtered

NameError: name 'sf_salesstaff' is not defined

## Selecties op meerdere tabellen zonder functies

Geef een overzicht met daarin het eerste adres en de stad van vestigingen van klanten uit ‘Netherlands’ (2 kolommen, 20 rijen)

In [14]:
sf_merge = sf_retailer.merge(sf_country, on='COUNTRY_CODE')

sf_nl = sf_merge[sf_merge['COUNTRY'] == 'Netherlands']
sf_nl[['ADDRESS1', 'CITY']].head(20)

                      ADDRESS1          CITY
240                   Beets 36         Beets
241               Perestraat 1      Deventer
242  Laan van Meerdervoort 966      Den Haag
243             Kalfjeslaan 47    Amstelveen
244               Startbaan 11    Amstelveen
245      Noorderspoorsingel 28     Groningen
246              Hogehilweg 13     Amsterdam
247             Spoorstraat 43    Varsseveld
248             Westhavenweg 8     Amsterdam
249              Westzeedijk 4        Muiden
250            Gooiergracht 91         Laren
251            Hoofdstraat 150   Pieterburen
252                Olde Diek 2         Laren
253     Amsterdamsestraatweg 8      Maarssen
254        Krayenhoffstraat 11     Amsterdam
255         Overschiestraat 19     Amsterdam
256              Havenbuurt 12        Marken
257               Duivendaal 1    Wageningen
258              Voorstraat 37  Nieuweschans
259         Stadhouderslaan 18     Rotterdam

Geef een overzicht met daarin de productnamen die tot het producttype ‘Eyewear’ behoren. (1 kolom, 5 rijen)

In [37]:
#error
sql_queryrpt = "SELECT * FROM product_type;"
sf_product_type = pd.read_sql_query(sql_querypt, sales_conn)

sf_merge = sf_product_type.merge(sf_product, on='PRODUCT_TYPE_CODE')
sf_eye = sf_merge[sf_merge['PRODUCT_NAME'].str.contains('eyewear')]

NameError: name 'sql_querypt' is not defined

Geef een overzicht met daarin alle unieke eerste adressen van klantvestigingen en de voornaam en achternaam van de verkopers die ‘Branch Manager’ zijn en aan deze vestigingen hebben verkocht (3 kolommen, 1 rij)

In [29]:
sql_querysb = "SELECT * FROM sales_branch;"
sf_salesbranch = pd.read_sql(sql_querysb, sales_conn)

sf_merge = sf_order_header.merge(sf_salesstaff, on='SALES_STAFF_CODE')
sf_merge = sf_merge.merge(sf_retailer, on='RETAILER_SITE_CODE')

filtered = sf_merge.loc[sf_merge['POSITION_EN'] == 'Branch Manager', ['ADDRESS1', 'FIRST_NAME', 'LAST_NAME']].drop_duplicates()
filtered

                  ADDRESS1 FIRST_NAME LAST_NAME
3185  Alameda Santos, 9876     Bayard     Lopes

Geef een overzicht met daarin van de verkopers hun functie en indien zij iets hebben verkocht de datum waarop de verkoop heeft plaatsgevonden. Laat alleen de verschillende namen van de posities zien van de verkopers die het woord ‘Manager’ in hun positienaam hebben staan. (2 kolommen, 7 rijen)

Geef een overzicht met daarin de verschillende namen van producten en bijbehorende namen van producttypen van de producten waarvoor ooit meer dan 750 stuks tegelijk verkocht zijn. (2 kolommen, 9 rijen)

Geef een overzicht met daarin de productnamen waarvan ooit meer dan 40% korting is verleend. De formule voor korting is: (unit_price - unit_sale_price) / unit_price (1 kolom, 8 rijen)

Geef een overzicht met daarin de retourreden van producten waarvan ooit meer dan 90% van de aangeschafte hoeveelheid is teruggebracht (return_quantity/quantity). (1 kolom, 3 rijen)

## Selecties op meerdere tabellen met functies

Geef een overzicht met daarin per producttype het aantal producten die tot dat producttype behoren. (2 kolommen, 21 rijen)

Geef een overzicht met daarin per land het aantal vestigingen van klanten die zich in dat land bevinden. (2 kolommen, 21 rijen)

Geef een overzicht met daarin van de producten behorend tot het producttype ‘Cooking Gear’ per productnaam de totaal verkochte hoeveelheid en de gemiddelde verkoopprijs. Sorteer de uitkomst op totaal verkochte hoeveelheid. (4 kolommen, 10 rijen)

Geef een overzicht met daarin per land de naam van het land, de naam van de stad waar de verkoopafdeling is gevestigd (noem de kolomnaam in het overzicht ‘verkoper’) en het aantal steden waar zich klanten bevinden in dat land (noem de kolomnaam in het overzicht ‘klanten’) (3 kolommen, 29 rijen)

## Pythonvertalingen van SUBSELECT en UNION met o.a. for-loops

Geef een overzicht met daarin de voornaam en de achternaam van de medewerkers die nog nooit wat hebben verkocht (2 kolommen, 25 rijen)

In [33]:
staff_never_sold_df = pd.DataFrame(columns=["FIRST_NAME", "LAST_NAME"])
for index, row in sf_salesstaff.iterrows():
    # Controleren met een subselect of de medewerker voorkomt in order_header
    if sf_order_header[sf_order_header["SALES_STAFF_CODE"] == row["SALES_STAFF_CODE"]].empty:
        staff_never_sold_df = pd.concat([staff_never_sold_df, pd.DataFrame({"FIRST_NAME": [row["FIRST_NAME"]], "LAST_NAME": [row["LAST_NAME"]]})], ignore_index=True)

# Beperken tot 25 rijen
staff_never_sold_limited = staff_never_sold_df.head(25)
staff_never_sold_limited

   FIRST_NAME      LAST_NAME
0       Denis           Pagé
1        Else         Mörike
2       Frank          Fuchs
3       Fritz         Hirsch
4        Jörg          Kunze
5       Maria      Iacobucci
6        Kick        Kalkman
7       Karin      Bergström
8       Sally          White
9       Frank        Bretton
10    Georges  Saint-Germain
11       Alex      Rodriguez
12   Samantha          Floyd
13      Julie          Olsen
14      Corey         Wright
15    Estelle        Johnson
16       Greg        Belding
17      Julie        Béchard
18      Lucía          Reyna
19     Kazumi        Uragome
20      Alice         Walter
21     Walter         Taylor
22   Penelope        Tamrine
23      Polly         Linton
24      Gracy        Gellens

Geef een overzicht met daarin het aantal producten waarvan de marge lager is dan de gemiddelde marge van alle producten samen. Geef in het overzicht tevens aan wat de gemiddelde marge is van dit aantal producten waarvan de marge lager dan de gemiddelde marge van alle producten samen is. (1 kolom, 2 rijen)

In [ ]:
staff_never_sold_df = pd.DataFrame(columns=["FIRST_NAME", "LAST_NAME"])
for index, row in sf_salesstaff.iterrows():
    # Controleren met een subselect of de medewerker voorkomt in order_header
    if sf_order_header[sf_order_header["SALES_STAFF_CODE"] == row["SALES_STAFF_CODE"]].empty:
        staff_never_sold_df = pd.concat([staff_never_sold_df, pd.DataFrame({"FIRST_NAME": [row["FIRST_NAME"]], "LAST_NAME": [row["LAST_NAME"]]})], ignore_index=True)

# Beperken tot 25 rijen
staff_never_sold_limited = staff_never_sold_df.head(25)
staff_never_sold_limited

Geef een overzicht met daarin de namen van de producten die voor meer dan 500 (verkoopprijs) zijn verkocht maar nooit zijn teruggebracht. (1 kolom, 13 rijen)

Geef een overzicht met daarin per (achternaam van) medewerker of hij/zij manager is of niet, door deze informatie toe te voegen als extra 'Ja/Nee'-kolom.<br>
Hint: gebruik een for-loop waarin je o.a. bepaalt of het woord 'Manager' in de functie (position_en) staat. (2 kolommen, 102 rijen).

Met de onderstaande code laat je Python het huidige jaar uitrekenen.

In [ ]:
from datetime import date
date.today().year

2024

Met de onderstaande code selecteer je op een bepaald jaartal uit een datum.

In [ ]:
from datetime import datetime

date_str = '16-8-2013'
date_format = '%d-%m-%Y'
date_obj = datetime.strptime(date_str, date_format)

date_obj.year

2013

Geef met behulp van bovenstaande hulpcode een overzicht met daarin op basis van het aantal jaar dat iemand in dienst is of een medewerker ‘kort in dienst’ (minder dan 25 jaar in dienst) of een ‘lang in dienst’ (groter gelijk dan 12 jaar in dienst) is. Geef daarbij per medewerker in een aparte kolom zowel ‘kort in dienst’ als ‘lang in dienst’ aan. Gebruik (wederom) een for-loop.<br>
(2 kolommen, 102 rijen)

## Van Jupyter Notebook naar Pythonproject

1. Richt de map waarin jullie tot nu toe hebben gewerkt in volgens de mappenstructuur uit de slides.
2. Maak van de ontstane mappenstructuur een Pythonproject dat uitvoerbaar is vanuit de terminal. Maak daarin een .py-bestand dat minstens 5 antwoorden uit dit notebook (in de vorm van een DataFrame) exporteert naar Excelbestanden. Alle notebooks mogen als notebook blijven bestaan.
3. Zorg ervoor dat dit Pythonproject zijn eigen repo heeft op Github. Let op: je virtual environment moet <b><u>niet</u></b> meegaan naar Github.

Je mag tijdens dit proces je uit stap 1 ontstane mappenstructuur aanpassen, zolang je bij het beoordelingsmoment kan verantwoorden wat de motivatie hierachter is. De slides verplichten je dus nergens toe.